
const quotes_array =[
  "\"your effort to remain what you are is what limits you...\"",
  "\"high socks are cool, gotta wear them outside!\"",
  "\"the computer’s kaput and we’re drifting through space towards certain oblivion.\"",
  "\"we weep for a bird’s cry, but not for a fish’s blood. blessed are those with a voice.\""
];
let interval
let write_text=""

/* The speed/duration of the effect in milliseconds */
function loadTyping() {
  write_text=quotes_array[getRandomInt(quotes_array.length)]
    let i = 0;
    setTimeout(function(){
        let speed = 40;
        
        interval = setInterval(function(){
            if (i === write_text.length) {
                // console.log("clearing")
                clearInterval(interval);
            }  
            type(i); 
            i++;
            
        },speed);
    

    },2000)
    let cursor = true;
    setInterval(function(){
        if (i >= write_text.length) {
            
        if(cursor) {
            //console.log("1")
            document.getElementById('typed').textContent = write_text ;
            cursor = false;
          }else {
            //console.log("2")
            document.getElementById('typed').textContent = write_text + "|";
            cursor = true;
          }
        }
        else if(i===0){
            if(cursor) {
                //console.log("3")
                document.getElementById('typed').textContent = "" ;
                cursor = false;
              }else {
                //console.log("4")
                document.getElementById('typed').textContent = "|";
                cursor = true;
              }
        }
    }, 500); 
}

function type(i){
    document.getElementById("typed").textContent = write_text.substring(0,i)+"|";
}
const write_text2="´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´·—‡¾äÓÚâÔœ#WKqAâÙFeV7’´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´\n"+
"´´´´´´´´´´´´´´´´´´´´´´´´´´´´´·¼ÜÁÈÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆËÁÖí¨´´´´´´´´´´´´´´´´´´´´´´´´´´´´´\n"+
"´´´´´´´´´´´´´´´´´´´´´´´´´¨IÁÆÆÆÆÆÆÆÆÆËÅRßÿ9&Vó@±2Oá¶g#ÈÑÆÆÆÆÆÆÆÆØü˜´´´´´´´´´´´´´´´´´´´´´´´´´\n"+
"´´´´´´´´´´´´´´´´´´´´´´|OÃÆÆÆÆÆÆþbV{¨´´´´´´´´´´´´´´´´´´´´¨•LñKÆÆÆÆÆÆÑá¿¨´´´´´´´´´´´´´´´´´´´´´\n"+
"´´´´´´´´´´´´´´´´´´´¡ÿËÆÆÆÆÆÄwª¨´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´³±XÆÆÆÆÆØ$?´´´´´´´´´´´´´´´´´´´\n"+
"´´´´´´´´´´´´´´´´´©ÈÆÆÆÆÆÆÆÊU´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´|ÜÆÆÆÆÆM9¨´´´´´´´´´´´´´´´´\n"+
"´´´´´´´´´´´´´´¨VÊÆÆÆÆBÆÆÆÆÆÆÉV´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´{ßÆÆÆÆÆT·´´´´´´´´´´´´´´\n"+
"´´´´´´´´´´´´¨&ÆÆÆÆÆ®‘´‘ÞÆÆÆÆÆÆm²´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´˜TØÆÆÆÆa¨´´´´´´´´´´´´\n"+
"´´´´´´´´´´´JBÆÆÆØw¨´´´´´„8ÆÆÆÆÆÆµ´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´‰ÃÆÆÆBn´´´´´´´´´´´\n"+
"´´´´´´´´´·gÆÆÆÆD¨´´´´´´´´´}ÈÆÆÆÆÆA‹´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´yÆÆÆÆŽ¸´´´´´´´´´\n"+
"´´´´´´´´‡ÆÆÆÆN~´´´´´´´´´´´´´TÆÆÆÆÆË¿´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´¨‘(dÆÆÆÆÆ¤´´´´´´´´\n"+
"´´´´´´¨žÆÆÆÑ4´´´´´´´´´´´´´´´´)ÀÆÆÆÆÆY´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´ˆíÏÒÉÆÆÆÆÆÆÆÆÆÆÆŸ¨´´´´´´\n"+
"´´´´´¨ZÆÆÆÆÓ·´´´´´´´´´´´´´´´´´·ðÆÆÆÆÆð¨´´´´´´´´´´´´´´´´´´´´´´´´´:ZÐÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÿ·´´´´´\n"+
"´´´´´¶ÆÆÆÆÆÆÆÆs´´´´´´´´´´´´´´´´´6ÆÆÆÆÆÛ¹´´´´´´´´´´´´´´´´´´´´´²gÆÆÆÆÆÆÆÆÆÆÆÆÆÆØgm8qÆÆÆÆß´´´´´\n"+
"´´´´ýÆÆÆÆÆÆÆÆÆÆÆß?´´´´´´´´´´´´´´´zÆÆÆÆÆâˆ´´´´´´´´´´´´´´´´´²¶ÆÆÆÆÆÆÆÆÆÛàì¨´´´´´´´´´‹ÉÆÆÆm´´´´\n"+
"´´´4ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆý)´´´´´´´´´´´´´uÊÆÆÆÆ8´´´´´´´´´´´´´´´zKÆÆÆÆÆÆÆÁú÷´´´´´´´´´´´´´´´•ÉÆÆÆ§´´´\n"+
"´´?ÅÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÈb³´´´´´´´´´´´üÑÆÆÆÆÞ´´´´´´´´´´´´¸ÐÆÆÆÆÆÆWö·´´´´´´´´´´´´´´´´´´´ƒÆÆÆËo´´\n"+
"´·ÿÆÆÆêßÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÑÝ¨´´´´´´´´´ŸÆÆÆÆÆO´´´´´´´´´´2ÑÆÆÆÆÆÁ”´´´´´´´´´´´´´´´´´´´´´´¨ñÆÆÆé’´\n"+
"´tÆÆÆK„´´¨©ŠÑÆÆÆÆÆÆÆÆÆÆÆÆÆÆÚ¨´´´´´´´´ðÆÆÆÆ$´´´´´´´´´~RÆÆÆÆŽ¦´´´´´´´´´´´´´´´´´´´´´´´´´i#ÆÆÆó´\n"+
"´âÆÆÆ¾´´´´´´´{ŸËÆÆÆÆÆÆÆÆÆÆÆÆÿ´´´´´´´´´rhä¢´´´´´´´´´´´«éØê‰´´´´´´´´´´´´´´´´´´´´´´´´´´´´ÇÆÆÆÛ¨\n"+
"~ÆÆÆÆ’´´´´´´´´´´ˆ¼ÁÆÆÆÆÆÆÆÆM“´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´oÆÆÆÆ^\n"+
"&ÆÆÆp´´´´´´´´´´´´´´´´´¨¨¨´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´¨;íÎÜÀÊÆÆÆÆÆÆÆÆÆY\n"+
"âÆÆÆÑ3¨´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´¨|4¶#ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÚ\n"+
"ÀÆÆÆÆÆÃ4·´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´nÈÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆþ\n"+
"ÀÆÆÆÆÆÆÆÑ$¹´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´þÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÁ\n"+
"ÀÆÆÆÆÆÆÆÆÆÆÀ>´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´íÈÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÉKØÆÆÆÁ\n"+
"ÀÆÆÆzžØÆÆÆÆÆÆÑ¾’´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´¡VžÿGÛRÁÅÅÁêéà©ï:´´´WÆÆÆþ\n"+
"mÆÆÆa´;ÜÆÆÆÆÆÆÆÆßz´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´ƒÆÆÆÆX\n"+
"5ÆÆÆâ´´4ÆÆÆÆÆÆÆÆÆÆÆp+´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´ýÆÆÆÆµ\n"+
"¡ÆÆÆÆ’¨ÿÆA¨çQÆÆÆÆÆÆÆÆÆê}¨´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´†NÆÆÆÆ!\n"+
"´qÆÆÆ9~ÐÆw´´´•bMÆÆÆÆÆÆÆÆÆ#5•´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´¨ŸÆÆÆÆÐ¨\n"+
"´nÆÆÆQýÆÆ’´´´´´´¿ðÆÆÆÆÆÆÆÆÆÆÆÐ6²´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´„aÖœÑÆÆÆÆÆw´\n"+
"´‚GÆÆÆÆÆX´´´´´´´´´ÿÆÆÆÆÆÆÆÆÆÆÆÆÆÆÃp¼¸´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´˜¢AÂÑÆÆÆÆÆÆÆÆÆÆÛ³´\n"+
"´´tÉÆÆÆÆO´´´´´´´´´RÆ§¨¨ùmÃÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆBßZ¾w‡%crjvvvjrrrî¤‰™û8XÃÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÑV´´\n"+
"´´´äÆÆÆÆî´´´´´´´´´ÆÆ&´´´´´·%OÐÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆBÓBÆÆÆÆÆÚ¨´´\n"+
"´´´¨qÆÆÆÅ·´´´´´´´˜ÆÑn´´´´´´´´´´ˆ÷ƒýËÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆy¡ˆ´´¢MÆÆÆÆÈ·´´´\n"+
"´´´´´ÁÆÆÆB’´´´´´´¡ÆËo´´´´´´´´´´´´´´´´RÆá¤äÄÑÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ#Öö‹¨´´´¾ÆÔ;´´´>ÈÆÆÆÆË¨´´´´\n"+
"´´´´´·ðÆÆÆÀ}´´´´´sÆÅ)´´´´´´´´´´´´´´´´ÆÆz´´´´´´´´´´´´´´´´´ïØÆ„´´´´´´´´´´´´ŽÆh´´´lØÆÆÆÆÛ:´´´´´\n"+
"´´´´´´·ÿÆÆÆË‰´´´´SÆg˜´´´´´´´´´´´´´´´‘ÆÑí´´´´´´´´´´´´´´´´´ÎÆÅ´´´´´´´´´´´´iØË‰´´¾ÆÆÆÆÆâ‚´´´´´´\n"+
"´´´´´´´´ÎÆÆÆÆA·´´ÓÆâ´´´´´´´´´´´´´´´´LÆÁ!´´´´´´´´´´´´´´´´›WÆí´´´´´´´´´´´´SÆê˜;GÆÆÆÆÆD¨´´´´´´´\n"+
"´´´´´´´´´”ÆÆÆÆÆy·ðÆÿ´´´´´´´´´´´´´´´´âÆÙ¨´´´´´´´´´´´´´´´´óÆË·´´´´´´´´´´´¸ßÆd‰ÊÆÆÆÆÆ[´´´´´´´´´\n"+
"´´´´´´´´´´¨TÊÆÆÆØÆÆT´´´´´´´´´´´´´´´´ŽÆ§´´´´´´´´´´´´´´´´´QÆ3´´´´´´´´´´´´íÈÆÆÆÆÆÆÑF·´´´´´´´´´´\n"+
"´´´´´´´´´´´´^âÆÆÆÆÆä´´´´´´´´´´´´´´´’ÁÆ4´´´´´´´´´´´´´´´´cÆÈ¦´´´´´´´´´´´´aÆÆÆÆÆÆA¡´´´´´´´´´´´´\n"+
"´´´´´´´´´´´´´´^âÆÆÆÆQŸ·´´´´´´´´´´´´sMÈr´´´´´´´´´´´´´´´´ÅÆ§´´´´´´´´´´´YXÆÆÆÆÆð¯´´´´´´´´´´´´´´\n"+
"´´´´´´´´´´´´´´´´ˆÓÆÆÆÆÆÊú·´´´´´´´´´ŸÆR¨´´´´´´´´´´´´´´´¿ÆØö´´´´´´´´oþÆÆÆÆÆÆé’´´´´´´´´´´´´´´´´\n"+
"´´´´´´´´´´´´´´´´´´´öœÆÆÆÆÆØÓ†’´´´´´bÆA´´´´´´´´´´´´´´´´ÙÆ¶·´´´´:zœÆÆÆÆÆÆÀ0´´´´´´´´´´´´´´´´´´´\n"+
"´´´´´´´´´´´´´´´´´´´´´:wþÆÆÆÆÆÆÊXáV@gÆñ´´´´´´´´´´´´´´´’gÆÿ)±FþÆÆÆÆÆÆÆÅú­´´´´´´´´´´´´´´´´´´´´´\n"+
"´´´´´´´´´´´´´´´´´´´´´´´´¨?8ÆÆÆÆÆÆÆÆÆÆÆÃ#Äœqßðýýý$âŠXÀÈÆÆÆÆÆÆÆÆÆÆÆAí·´´´´´´´´´´´´´´´´´´´´´´´´\n"+
"´´´´´´´´´´´´´´´´´´´´´´´´´´´´´+ÓÂÑÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÑÃÚ>´´´´´´´´´´´´´´´´´´´´´´´´´´´´´\n"+
"´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´¹jaàÙAÁØØØØØØØØØØQg¶b5ï’´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´´\n"

const write_text3 = 
"#include <ulty.io>\n"+
"#include <iostream>\n"+
"#include <stream>\n"+
"\n"+
"using namespace std;\n"+
"\n"+
"main(){\n"+
  "\tcout << \"your effort to remain what you are\" << endl;\n"+
  "\tcout << \"is what limits you...\" << endl;\n"+
"}"; 


function getRandomInt(max) {
  return Math.floor(Math.random() * max);
}

// Example usage:
//const randomChar = getRandomCharacter();
//console.log(randomChar);
